# parameters
nc: 80  # number of classes
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3, {}]],  # 0-P1/2
   [-1, 1, Conv_search_merge, [128, [[1,1],[3,1],[5,1],[3,2]], [0.5,0.75,1.0], 2, {'gumbel_channel':True}]],  # 1-P2/4
   [-1, 3, C3_search_merge, [128, [[3,1],[5,1],[3,2]], [0.5,0.75,1.0], {'search_c2': [0.75, 1.0], 'gumbel_channel':True}]],
   [-1, 1, Conv_search_merge, [256, [[1,1],[3,1],[5,1],[3,2]], [0.5,0.75,1.0], 2, {'gumbel_channel':True}]],  # 3-P3/8
   [-1, 9, C3_search_merge, [256, [[3,1],[5,1],[3,2]], [0.5,0.75,1.0], {'search_c2': [0.75, 1.0], 'gumbel_channel':True}]],
   [-1, 1, Conv_search_merge, [512, [[1,1],[3,1],[5,1],[3,2]], [0.5,0.75,1.0], 2, {'gumbel_channel':True}]],  # 5-P4/16
   [-1, 9, C3_search_merge, [512, [[3,1],[5,1],[3,2]], [0.5,0.75,1.0], {'search_c2': [0.75, 1.0], 'gumbel_channel':True}]],
   [-1, 1, Conv_search_merge, [1024, [[1,1],[3,1],[5,1],[3,2]], [0.5,0.75,1.0], 2, {'gumbel_channel':True}]],  # 7-P5/32
   [-1, 1, SPP_search, [1024, [5, 9, 13], {}]],
  ]

# Auto-Feature-Fusion
head:
  [[[-1, 6, 4], 1, AFF, [1024, [1,2,4], [[1,1],[3,1],[5,1],[3,2]], {'candidate_e': [0.5,0.75,1.0], 'gumbel_channel':True, 'separable': True}]],
   [-1, 3, C3_search_merge, [1024, [[3,1],[5,1],[3,2]], [0.5,0.75,1.0], False, {'search_c2': [0.75, 1.0], 'gumbel_channel':True}]],  # 10-Reverse-Fusion /32

   [[-1, 8, 6, 4], 1, AFF, [512, [0.5,0.5,1,2], [[1,1],[3,1],[5,1],[3,2]], {'candidate_e': [0.5,0.75,1.0], 'gumbel_channel':True, 'separable': True}]],
   [-1, 3, C3_search_merge, [512, [[3,1],[5,1],[3,2]], [0.5,0.75,1.0], False, {'search_c2': [0.75, 1.0], 'gumbel_channel':True}]],  # 12-Reverse-Fusion /16

   [[-1, 10, 8, 6, 4], 1, AFF, [256, [0.5,0.25,0.25,0.5,1], [[1,1],[3,1],[5,1],[3,2]], {'candidate_e': [0.5,0.75,1.0], 'gumbel_channel':True, 'separable': True}]],
   [-1, 3, C3_search_merge, [256, [[3,1],[5,1],[3,2]], [0.5,0.75,1.0], False, {'search_c2': [0.75, 1.0], 'gumbel_channel':True}]],  # 14-Reverse-Fusion /8

   [[-1, 12, 10], 1, AFF, [256, [1,0.5,0.25], [[1,1],[3,1],[5,1],[3,2]], {'candidate_e': [0.5,0.75,1.0], 'gumbel_channel':True, 'separable': True}]],
   [-1, 3, C3_search_merge, [256, [[3,1],[5,1],[3,2]], [0.5,0.75,1.0], False, {'search_c2': [0.75, 1.0], 'gumbel_channel':True}]],  # 16-Fusion /8

   [[-1, 14, 12, 10], 1, AFF, [512, [2,2,1,0.5], [[1,1],[3,1],[5,1],[3,2]], {'candidate_e': [0.5,0.75,1.0], 'gumbel_channel':True, 'separable': True}]],
   [-1, 3, C3_search_merge, [512, [[3,1],[5,1],[3,2]], [0.5,0.75,1.0], False, {'search_c2': [0.75, 1.0], 'gumbel_channel':True}]],  # 18-Fusion /8

   [[-1, 16, 14, 12, 10], 1, AFF, [1024, [2,4,4,2,1], [[1,1],[3,1],[5,1],[3,2]], {'candidate_e': [0.5,0.75,1.0], 'gumbel_channel':True, 'separable': True}]],
   [-1, 3, C3_search_merge, [1024, [[3,1],[5,1],[3,2]], [0.5,0.75,1.0], False, {'search_c2': [0.75, 1.0], 'gumbel_channel':True}]],  # 20-Fusion /8

   [[16, 18, 20], 1, Detect, [nc, anchors, {}]],  # Detect(P3, P4, P5)
  ]









